---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.BuildingPad
source: html/e8b8d805-011d-4df5-4fb2-00a4f1a06b7a.htm
---
# BuildingPad Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.